import re
import os
import torch

import numpy as np
import pandas as pd

from tqdm import tqdm
from collections import defaultdict
from sentence_transformers import SentenceTransformer

def processInt(name, item, conjuction="次"):
    items = item.split('^')
    items = list(set(items))
    if '' in items:
        items.remove('')
    intitems = []
    for num in items:
        intitems.append(int(num))
    if len(items) == 1:
        return name + "结果为：" + items[0]
    elif len(items) > 1:
        return str(len(items)) + conjuction + name + "结果分别为" + "、".join(items)
    else:
        import pdb; pdb.set_trace()

def processFloat(name, item, conjuction="次"):
    items = item.split('^')
    items = list(set(items))
    if '' in items:
        items.remove('')
    intitems = []
    for num in items:
        intitems.append(float(num))
    if len(items) == 1:
        return name + "结果为：" + items[0]
    elif len(items) > 1:
        return str(len(items)) + conjuction + name + "结果分别为" + "、".join(items)
    else:
        import pdb; pdb.set_trace()

def processStr(name, item, conjuction="次", require_name=True, reduce=False):
    items = item.split('^')
    if reduce:
        items = list(set(items))
    while '' in items:
        items.remove('')
    if len(items) == 0:
        return ''
    if len(items) == 1:
        if require_name:
            return name + "为：" + items[0]
        else:
            return items[0]
    elif len(items) > 1:
        if require_name:
            return str(len(items)) + conjuction + name + "分别为" + "、".join(items)
        else:
            return "，".join(items)
    else:
        import pdb; pdb.set_trace()

def processColumn(name, value, conjuction="次", require_name=True, comma=True, reduce=False):
    outText = ''
    if value != '':
        outText = processStr(name, value, conjuction, require_name, reduce)
    if comma and outText != '':
        return outText + "，"
    return outText

def processValueIndex(indexMeta):
    outText = ''
    if indexMeta[0] == '':
        return ''
    
    # if indexMeta[0] != indexMeta[-1] \
    #     and '-' not in indexMeta[-1] and '+' not in indexMeta[-1] \
    #     and '阴性' not in indexMeta[-1] and '阳性' not in indexMeta[-1]:
    #     print(indexMeta[1], indexMeta[0], indexMeta[-1])

    if indexMeta[0] != indexMeta[-1] and indexMeta[4] != '':
        if indexMeta[4] == 'N' and indexMeta[-1] == '阴性':
            pass
        else:
            print(indexMeta[1], indexMeta[0], indexMeta[4], indexMeta[-1])
    
    names = indexMeta[1].split('^')
    values = indexMeta[0].split('^')
    if indexMeta[5] == '':
        units = [''] * len(values)
    elif '*10^' in indexMeta[5]:
        units = re.findall(r'\*[^*]+?/L|[^*^]+?(?=\^|$)', indexMeta[5])
    else:
        units = indexMeta[5].split('^')

    # maxTimes = 10
    # if len(names) > maxTimes:
    #     names = names[:maxTimes]
    # if len(values) > maxTimes:
    #     values = values[:maxTimes]
    # if len(units) > maxTimes:
    #     units = units[:maxTimes]

    uniqueNames = list(set(names))
    uniqueUnits = list(set(units))

    if len(values) != len(units):
        if len(values) < len(units) and len(uniqueUnits) == 1:
            units = units[:len(values)]
        else:
            import pdb; pdb.set_trace()

    if len(uniqueNames) == 1:
        if len(values) == 1:
            outText += names[0] + "结果为" + values[0] + units[0] + "，"
        elif len(values) > 1:
            if len(uniqueUnits) == 1:
                outText += str(len(values)) + "次" + names[0] + "结果分别为" + "、".join(values) + units[0] + "，"
            else:
                outText += str(len(values)) + "次" + names[0] + "结果分别为" + "、".join([value+unit for value, unit in zip(values, units)]) + "，"
        else:
            import pdb; pdb.set_trace()
    elif len(uniqueNames) > 1:
        try:
            assert len(names) == len(values) == len(units)
        except:
            if len(values) == len(units) and len(names) > len(values):
                names = names[:len(values)]
            else:
                import pdb; pdb.set_trace()
        indexDict = defaultdict(list)
        for i, name in enumerate(names):
            indexDict[name].append([values[i], units[i]])
        for index in indexDict.keys():
            outText += str(len(values)) + "次" + names[0] + "结果分别为" + "、".join([value+unit for value, unit in indexDict[index]]) + "，"
    else:
        import pdb; pdb.set_trace()

    if indexMeta[4] != '' or indexMeta[-1] != '':
        abnormals = []
        if indexMeta[4] != '':
            abnormals += indexMeta[4].split('^')
        if indexMeta[-1] != '':
            abnormals += indexMeta[-1].split('^')
        outText += "其中"
        if 'H' in abnormals:
            outText += "有些偏高，"
        if 'L' in abnormals:
            outText += "有些偏低，"
        if '+' in abnormals or '阳性' in abnormals:
            outText += "有些为阳性，"
        if '-' in abnormals or '阴性' in abnormals:
            outText += "有些为阴性，"

    return outText

def processReportIndex(indexMeta, columns):
    outText = ''
    if indexMeta[0] == '':
        return ''
    
    if indexMeta[0] != indexMeta[2]:
        if indexMeta[2] == '':
            indexMeta[2] = indexMeta[0]
        else:
            import pdb; pdb.set_trace()
            print(columns[0], indexMeta[0], indexMeta[2])
    
    findings = indexMeta[1].split('^')
    results = indexMeta[2].split('^')

    while '' in findings:
        findings.remove('')
    while '' in results:
        results.remove('')

    try:
        assert len(findings) == len(results)
    except:
        import pdb; pdb.set_trace()

    findings = list(set(findings))
    results = list(set(results))

    if len(findings) == 1:
            outText += columns[0] + "检查所见为" + findings[0]
    elif len(findings) > 1:
        outText += str(len(findings)) + "次检查所见分别为" + "和".join(findings)
    else:
        import pdb; pdb.set_trace()

    if len(results) == 1:
            outText += columns[0] + "检查结果为" + results[0]
    elif len(results) > 1:
        outText += str(len(findings)) + "次检查结果分别为" + "和".join(findings)
    else:
        import pdb; pdb.set_trace()

    return outText

def processRow(row, columns):
    sentences = []
    text = "该患者"
    
    # 1 就诊科室 drop
    # 2 就诊日期时间 drop
    # 3 出院日期时间 drop
    # 4 就诊类型 drop
    # 5 就诊时年龄
    age = int(row[4])
    text += str(age) + "岁，"
    sentences.append("患者" + str(age) + "岁。")
    # 6 姓名 drop
    # 7 性别
    gender = row[6]
    if gender not in ["男", "女"]:
        import pdb; pdb.set_trace()
    text += "性别" + gender + "，"
    sentences.append("患者" + "性别" + gender + "。")
    # 8 登记号 drop
    # 9 首页入院时间 drop
    # 10 首页出院主要诊断 ？
    text += processColumn(columns[9], row[9], conjuction="个")
    sentences.append("患者" + processColumn(columns[9], row[9], conjuction="个", comma=False) + '。')
    # 11 首页出院其他诊断 ？
    text += processColumn(columns[10], row[10], conjuction="个")
    sentences.append("患者" + processColumn(columns[10], row[10], conjuction="个", comma=False) + '。')
    # 12 首页手术操作名称 ？
    text += processColumn(columns[11], row[11], conjuction="个")
    sentences.append("患者" + processColumn(columns[11], row[11], conjuction="个", comma=False) + '。')
    # 13 出院时间 drop
    # 14 超声检查方法
    text += processColumn(columns[13], row[13], conjuction="个")
    sentences.append("患者" + processColumn(columns[13], row[13], conjuction="个", comma=False) + '。')
    # 15 超声报告时间 drop
    # 16 超声检查所见
    text += processColumn(columns[15], row[15], conjuction="个", comma=False)
    sentences.append("患者" + processColumn(columns[15], row[15], conjuction="个", comma=False))
    # 17 超声诊断意见
    text += processColumn(columns[16], row[16], conjuction="个")
    sentences.append("患者" + processColumn(columns[16], row[16], conjuction="个", comma=False) + '。')
    # 18 主动脉窦部 drop
    # 19 与左室后壁运动
    text += processColumn(columns[18], row[18], require_name=False, reduce=True)
    sentences.append("患者" + processColumn(columns[18], row[18], require_name=False, reduce=True, comma=False) + '。')
    # 20 超声id drop
    # 21 超声主动脉窦部
    # 22 超声升主动脉内径
    # 23 超声瓣口面积
    # 24 超声瓣环径
    # 25 超声压力减半时间
    # 26 超声主干径      
    # 27 超声右肺动脉径
    # 28 超声左肺动脉径
    # 29 超声左房
    # 30 超声右房
    # 31 超声厚度
    # 32 超声运动幅度
    # 33 超声室间隔描述
    # 34 超声舒末内径
    # 35 超声收末内径
    # 36 超声室间隔运动幅度
    # 37 超声前后径
    # 38 超声左右径
    # 39 超声流出道
    # 40 超声射血分数
    # 41 超声缩短分数
    # 42 超声主动脉最大流速
    # 43 超声左室流出道流速
    # 44 超声E波最大流速
    # 45 超声A波最大流速
    # 46 超声肺动脉最大流速
    # 47 超声收缩期流速
    # 48 超声收缩期压差
    # 49 超声舒张期流速
    # 50 超声舒张期压差
    for i in range(21, 50):
        text += processColumn(columns[i], row[i])
        sentences.append("患者" + processColumn(columns[i], row[i], comma=False) + '。')
    # 51 身高
    text += processColumn(columns[50], row[50])
    sentences.append("患者" + processColumn(columns[50], row[50], comma=False) + '。')
    # 52 体重
    text += processColumn(columns[51], row[51])
    sentences.append("患者" + processColumn(columns[51], row[51], comma=False) + '。')
    # 53 身高体重测量时间 drop
    # 54 诊断名称新
    text += processColumn("诊断名称", row[53])
    sentences.append("患者" + processColumn("诊断名称", row[53], comma=False) + '。')
    # 55 *白细胞(WBC)-检验项值
    # 56 *白细胞(WBC)-检验项值_检验项名称
    # 57 *白细胞(WBC)-检验项值_检验项编码（别名）
    # 58 *白细胞(WBC)-检验项值_接收时间
    # 59 *白细胞(WBC)-检验项值_异常提示
    # 60 *白细胞(WBC)-检验项值_单位
    # 61 *白细胞(WBC)-检验项值_检验定性结果
    # 62 红细胞(RBC)-检验项值
    # 63 红细胞(RBC)-检验项值_检验项名称
    # 64 红细胞(RBC)-检验项值_检验项编码（别名）
    # 65 红细胞(RBC)-检验项值_接收时间
    # 66 红细胞(RBC)-检验项值_异常提示
    # 67 红细胞(RBC)-检验项值_单位
    # 68 红细胞(RBC)-检验项值_检验定性结果
    # 69 *血小板(PLT)-检验项值
    # 70 *血小板(PLT)-检验项值_检验项名称
    # 71 *血小板(PLT)-检验项值_检验项编码（别名）
    # 72 *血小板(PLT)-检验项值_接收时间
    # 73 *血小板(PLT)-检验项值_异常提示
    # 74 *血小板(PLT)-检验项值_单位
    # 75 *血小板(PLT)-检验项值_检验定性结果
    # 76 *血红蛋白(Hb)-检验项值
    # 77 *血红蛋白(Hb)-检验项值_检验项名称
    # 78 *血红蛋白(Hb)-检验项值_检验项编码（别名）
    # 79 *血红蛋白(Hb)-检验项值_接收时间
    # 80 *血红蛋白(Hb)-检验项值_异常提示
    # 81 *血红蛋白(Hb)-检验项值_单位
    # 82 *血红蛋白(Hb)-检验项值_检验定性结果
    # 83 淋巴细胞百分比(LYM%)-检验项值
    # 84 淋巴细胞百分比(LYM%)-检验项值_检验项名称
    # 85 淋巴细胞百分比(LYM%)-检验项值_检验项编码（别名）
    # 86 淋巴细胞百分比(LYM%)-检验项值_接收时间
    # 87 淋巴细胞百分比(LYM%)-检验项值_异常提示
    # 88 淋巴细胞百分比(LYM%)-检验项值_单位
    # 89 淋巴细胞百分比(LYM%)-检验项值_检验定性结果
    # 90 单核细胞百分比(MONO%)-检验项值
    # 91 单核细胞百分比(MONO%)-检验项值_检验项名称
    # 92 单核细胞百分比(MONO%)-检验项值_检验项编码（别名）
    # 93 单核细胞百分比(MONO%)-检验项值_接收时间
    # 94 单核细胞百分比(MONO%)-检验项值_异常提示
    # 95 单核细胞百分比(MONO%)-检验项值_单位
    # 96 单核细胞百分比(MONO%)-检验项值_检验定性结果
    # 97 中性粒细胞百分比(NE%)-检验项值
    # 98 中性粒细胞百分比(NE%)-检验项值_检验项名称
    # 99 中性粒细胞百分比(NE%)-检验项值_检验项编码（别名）
    # 100 中性粒细胞百分比(NE%)-检验项值_接收时间
    # 101 中性粒细胞百分比(NE%)-检验项值_异常提示
    # 102 中性粒细胞百分比(NE%)-检验项值_单位
    # 103 中性粒细胞百分比(NE%)-检验项值_检验定性结果
    # 104 淋巴细胞数(LYM)-检验项值
    # 105 淋巴细胞数(LYM)-检验项值_检验项名称
    # 106 淋巴细胞数(LYM)-检验项值_检验项编码（别名）
    # 107 淋巴细胞数(LYM)-检验项值_接收时间
    # 108 淋巴细胞数(LYM)-检验项值_异常提示
    # 109 淋巴细胞数(LYM)-检验项值_单位
    # 110 淋巴细胞数(LYM)-检验项值_检验定性结果
    # 111 单核细胞数(MONO)-检验项值
    # 112 单核细胞数(MONO)-检验项值_检验项名称
    # 113 单核细胞数(MONO)-检验项值_检验项编码（别名）
    # 114 单核细胞数(MONO)-检验项值_接收时间
    # 115 单核细胞数(MONO)-检验项值_异常提示
    # 116 单核细胞数(MONO)-检验项值_单位
    # 117 单核细胞数(MONO)-检验项值_检验定性结果
    # 118 中性粒细胞数(NE)-检验项值
    # 119 中性粒细胞数(NE)-检验项值_检验项名称
    # 120 中性粒细胞数(NE)-检验项值_检验项编码（别名）
    # 121 中性粒细胞数(NE)-检验项值_接收时间
    # 122 中性粒细胞数(NE)-检验项值_异常提示
    # 123 中性粒细胞数(NE)-检验项值_单位
    # 124 中性粒细胞数(NE)-检验项值_检验定性结果
    # 125 *红细胞压积(HCT)-检验项值
    # 126 *红细胞压积(HCT)-检验项值_检验项名称
    # 127 *红细胞压积(HCT)-检验项值_检验项编码（别名）
    # 128 *红细胞压积(HCT)-检验项值_接收时间
    # 129 *红细胞压积(HCT)-检验项值_异常提示
    # 130 *红细胞压积(HCT)-检验项值_单位
    # 131 *红细胞压积(HCT)-检验项值_检验定性结果
    # 132 *红细胞平均体积(MCV)-检验项值
    # 133 *红细胞平均体积(MCV)-检验项值_检验项名称
    # 134 *红细胞平均体积(MCV)-检验项值_检验项编码（别名）
    # 135 *红细胞平均体积(MCV)-检验项值_接收时间
    # 136 *红细胞平均体积(MCV)-检验项值_异常提示
    # 137 *红细胞平均体积(MCV)-检验项值_单位
    # 138 *红细胞平均体积(MCV)-检验项值_检验定性结果
    # 139 *平均血红蛋白量(MCH)-检验项值
    # 140 *平均血红蛋白量(MCH)-检验项值_检验项名称
    # 141 *平均血红蛋白量(MCH)-检验项值_检验项编码（别名）
    # 142 *平均血红蛋白量(MCH)-检验项值_接收时间
    # 143 *平均血红蛋白量(MCH)-检验项值_异常提示
    # 144 *平均血红蛋白量(MCH)-检验项值_单位
    # 145 *平均血红蛋白量(MCH)-检验项值_检验定性结果
    # 146 *平均血红蛋白浓度(MCHC)-检验项值
    # 147 *平均血红蛋白浓度(MCHC)-检验项值_检验项名称
    # 148 *平均血红蛋白浓度(MCHC)-检验项值_检验项编码（别名）
    # 149 *平均血红蛋白浓度(MCHC)-检验项值_接收时间
    # 150 *平均血红蛋白浓度(MCHC)-检验项值_异常提示
    # 151 *平均血红蛋白浓度(MCHC)-检验项值_单位
    # 152 *平均血红蛋白浓度(MCHC)-检验项值_检验定性结果
    # 153 红细胞分布宽度-SD值(RDW-SD)-检验项值
    # 154 红细胞分布宽度-SD值(RDW-SD)-检验项值_检验项名称
    # 155 红细胞分布宽度-SD值(RDW-SD)-检验项值_检验项编码（别名）
    # 156 红细胞分布宽度-SD值(RDW-SD)-检验项值_接收时间
    # 157 红细胞分布宽度-SD值(RDW-SD)-检验项值_异常提示
    # 158 红细胞分布宽度-SD值(RDW-SD)-检验项值_单位
    # 159 红细胞分布宽度-SD值(RDW-SD)-检验项值_检验定性结果
    # 160 红细胞分布宽度-CV值(RDW-CV)-检验项值
    # 161 红细胞分布宽度-CV值(RDW-CV)-检验项值_检验项名称
    # 162 红细胞分布宽度-CV值(RDW-CV)-检验项值_检验项编码（别名）
    # 163 红细胞分布宽度-CV值(RDW-CV)-检验项值_接收时间
    # 164 红细胞分布宽度-CV值(RDW-CV)-检验项值_异常提示
    # 165 红细胞分布宽度-CV值(RDW-CV)-检验项值_单位
    # 166 红细胞分布宽度-CV值(RDW-CV)-检验项值_检验定性结果
    # 167 血小板平均体积(MPV)-检验项值
    # 168 血小板平均体积(MPV)-检验项值_检验项名称
    # 169 血小板平均体积(MPV)-检验项值_检验项编码（别名）
    # 170 血小板平均体积(MPV)-检验项值_接收时间
    # 171 血小板平均体积(MPV)-检验项值_异常提示
    # 172 血小板平均体积(MPV)-检验项值_单位
    # 173 血小板平均体积(MPV)-检验项值_检验定性结果
    # 174 血小板压积(PCT)-检验项值
    # 175 血小板压积(PCT)-检验项值_检验项名称
    # 176 血小板压积(PCT)-检验项值_检验项编码（别名）
    # 177 血小板压积(PCT)-检验项值_接收时间
    # 178 血小板压积(PCT)-检验项值_异常提示
    # 179 血小板压积(PCT)-检验项值_单位
    # 180 血小板压积(PCT)-检验项值_检验定性结果
    # 181 血小板分布宽度(PDW)-检验项值
    # 182 血小板分布宽度(PDW)-检验项值_检验项名称
    # 183 血小板分布宽度(PDW)-检验项值_检验项编码（别名）
    # 184 血小板分布宽度(PDW)-检验项值_接收时间
    # 185 血小板分布宽度(PDW)-检验项值_异常提示
    # 186 血小板分布宽度(PDW)-检验项值_单位
    # 187 血小板分布宽度(PDW)-检验项值_检验定性结果
    # 188 嗜酸细胞数(EOS)-检验项值
    # 189 嗜酸细胞数(EOS)-检验项值_检验项名称
    # 190 嗜酸细胞数(EOS)-检验项值_检验项编码（别名）
    # 191 嗜酸细胞数(EOS)-检验项值_接收时间
    # 192 嗜酸细胞数(EOS)-检验项值_异常提示
    # 193 嗜酸细胞数(EOS)-检验项值_单位
    # 194 嗜酸细胞数(EOS)-检验项值_检验定性结果
    # 195 嗜酸细胞百分比(EOS%)-检验项值
    # 196 嗜酸细胞百分比(EOS%)-检验项值_检验项名称
    # 197 嗜酸细胞百分比(EOS%)-检验项值_检验项编码（别名）
    # 198 嗜酸细胞百分比(EOS%)-检验项值_接收时间
    # 199 嗜酸细胞百分比(EOS%)-检验项值_异常提示
    # 200 嗜酸细胞百分比(EOS%)-检验项值_单位
    # 201 嗜酸细胞百分比(EOS%)-检验项值_检验定性结果
    # 202 嗜碱细胞数(BAS)-检验项值
    # 203 嗜碱细胞数(BAS)-检验项值_检验项名称
    # 204 嗜碱细胞数(BAS)-检验项值_检验项编码（别名）
    # 205 嗜碱细胞数(BAS)-检验项值_接收时间
    # 206 嗜碱细胞数(BAS)-检验项值_异常提示
    # 207 嗜碱细胞数(BAS)-检验项值_单位
    # 208 嗜碱细胞数(BAS)-检验项值_检验定性结果
    # 209 嗜碱细胞百分比(BAS%)-检验项值
    # 210 嗜碱细胞百分比(BAS%)-检验项值_检验项名称
    # 211 嗜碱细胞百分比(BAS%)-检验项值_检验项编码（别名）
    # 212 嗜碱细胞百分比(BAS%)-检验项值_接收时间
    # 213 嗜碱细胞百分比(BAS%)-检验项值_异常提示
    # 214 嗜碱细胞百分比(BAS%)-检验项值_单位
    # 215 嗜碱细胞百分比(BAS%)-检验项值_检验定性结果
    # 216 大血小板比率(P-LCR)-检验项值
    # 217 大血小板比率(P-LCR)-检验项值_检验项名称
    # 218 大血小板比率(P-LCR)-检验项值_检验项编码（别名）
    # 219 大血小板比率(P-LCR)-检验项值_接收时间
    # 220 大血小板比率(P-LCR)-检验项值_异常提示
    # 221 大血小板比率(P-LCR)-检验项值_单位
    # 222 大血小板比率(P-LCR)-检验项值_检验定性结果
    # 223 快速C-反应蛋白-检验项值
    # 224 快速C-反应蛋白-检验项值_检验项名称
    # 225 快速C-反应蛋白-检验项值_检验项编码（别名）
    # 226 快速C-反应蛋白-检验项值_接收时间
    # 227 快速C-反应蛋白-检验项值_异常提示
    # 228 快速C-反应蛋白-检验项值_单位
    # 229 快速C-反应蛋白-检验项值_检验定性结果
    # 230 超敏C反应蛋白(hs-CRP)测定-检验项值
    # 231 超敏C反应蛋白(hs-CRP)测定-检验项值_检验项名称
    # 232 超敏C反应蛋白(hs-CRP)测定-检验项值_检验项编码（别名）
    # 233 超敏C反应蛋白(hs-CRP)测定-检验项值_接收时间
    # 234 超敏C反应蛋白(hs-CRP)测定-检验项值_异常提示
    # 235 超敏C反应蛋白(hs-CRP)测定-检验项值_单位
    # 236 超敏C反应蛋白(hs-CRP)测定-检验项值_检验定性结果
    # 237 *丙氨酸氨基转移酶(ALT)测定-检验项值
    # 238 *丙氨酸氨基转移酶(ALT)测定-检验项值_检验项名称
    # 239 *丙氨酸氨基转移酶(ALT)测定-检验项值_检验项编码（别名）
    # 240 *丙氨酸氨基转移酶(ALT)测定-检验项值_接收时间
    # 241 *丙氨酸氨基转移酶(ALT)测定-检验项值_异常提示
    # 242 *丙氨酸氨基转移酶(ALT)测定-检验项值_单位
    # 243 *丙氨酸氨基转移酶(ALT)测定-检验项值_检验定性结果
    # 244 *天门冬氨酸氨基转移酶(AST)测定-检验项值
    # 245 *天门冬氨酸氨基转移酶(AST)测定-检验项值_检验项名称
    # 246 *天门冬氨酸氨基转移酶(AST)测定-检验项值_检验项编码（别名）
    # 247 *天门冬氨酸氨基转移酶(AST)测定-检验项值_接收时间
    # 248 *天门冬氨酸氨基转移酶(AST)测定-检验项值_异常提示
    # 249 *天门冬氨酸氨基转移酶(AST)测定-检验项值_单位
    # 250 *天门冬氨酸氨基转移酶(AST)测定-检验项值_检验定性结果
    # 251 *甘油三酯(TG)测定-检验项值
    # 252 *甘油三酯(TG)测定-检验项值_检验项名称
    # 253 *甘油三酯(TG)测定-检验项值_检验项编码（别名）
    # 254 *甘油三酯(TG)测定-检验项值_接收时间
    # 255 *甘油三酯(TG)测定-检验项值_异常提示
    # 256 *甘油三酯(TG)测定-检验项值_单位
    # 257 *甘油三酯(TG)测定-检验项值_检验定性结果
    # 258 *总胆固醇(TC)测定-检验项值
    # 259 *总胆固醇(TC)测定-检验项值_检验项名称
    # 260 *总胆固醇(TC)测定-检验项值_检验项编码（别名）
    # 261 *总胆固醇(TC)测定-检验项值_接收时间
    # 262 *总胆固醇(TC)测定-检验项值_异常提示
    # 263 *总胆固醇(TC)测定-检验项值_单位
    # 264 *总胆固醇(TC)测定-检验项值_检验定性结果
    # 265 *高密度脂蛋白胆固醇(HDL-C)测定-检验项值
    # 266 *高密度脂蛋白胆固醇(HDL-C)测定-检验项值_检验项名称
    # 267 *高密度脂蛋白胆固醇(HDL-C)测定-检验项值_检验项编码（别名）
    # 268 *高密度脂蛋白胆固醇(HDL-C)测定-检验项值_接收时间
    # 269 *高密度脂蛋白胆固醇(HDL-C)测定-检验项值_异常提示
    # 270 *高密度脂蛋白胆固醇(HDL-C)测定-检验项值_单位
    # 271 *高密度脂蛋白胆固醇(HDL-C)测定-检验项值_检验定性结果
    # 272 *低密度脂蛋白胆固醇(LDL-C)测定-检验项值
    # 273 *低密度脂蛋白胆固醇(LDL-C)测定-检验项值_检验项名称
    # 274 *低密度脂蛋白胆固醇(LDL-C)测定-检验项值_检验项编码（别名）
    # 275 *低密度脂蛋白胆固醇(LDL-C)测定-检验项值_接收时间
    # 276 *低密度脂蛋白胆固醇(LDL-C)测定-检验项值_异常提示
    # 277 *低密度脂蛋白胆固醇(LDL-C)测定-检验项值_单位
    # 278 *低密度脂蛋白胆固醇(LDL-C)测定-检验项值_检验定性结果
    # 279 *尿素(Urea)测定-检验项值
    # 280 *尿素(Urea)测定-检验项值_检验项名称
    # 281 *尿素(Urea)测定-检验项值_检验项编码（别名）
    # 282 *尿素(Urea)测定-检验项值_接收时间
    # 283 *尿素(Urea)测定-检验项值_异常提示
    # 284 *尿素(Urea)测定-检验项值_单位
    # 285 *尿素(Urea)测定-检验项值_检验定性结果
    # 286 *肌酐(Cr)测定-苦味酸法-检验项值
    # 287 *肌酐(Cr)测定-苦味酸法-检验项值_检验项名称
    # 288 *肌酐(Cr)测定-苦味酸法-检验项值_检验项编码（别名）
    # 289 *肌酐(Cr)测定-苦味酸法-检验项值_接收时间
    # 290 *肌酐(Cr)测定-苦味酸法-检验项值_异常提示
    # 291 *肌酐(Cr)测定-苦味酸法-检验项值_单位
    # 292 *肌酐(Cr)测定-苦味酸法-检验项值_检验定性结果
    # 293 *尿酸(UA)测定-检验项值
    # 294 *尿酸(UA)测定-检验项值_检验项名称
    # 295 *尿酸(UA)测定-检验项值_检验项编码（别名）
    # 296 *尿酸(UA)测定-检验项值_接收时间
    # 297 *尿酸(UA)测定-检验项值_异常提示
    # 298 *尿酸(UA)测定-检验项值_单位
    # 299 *尿酸(UA)测定-检验项值_检验定性结果
    # 300 *葡萄糖(Glu)测定-检验项值
    # 301 *葡萄糖(Glu)测定-检验项值_检验项名称
    # 302 *葡萄糖(Glu)测定-检验项值_检验项编码（别名）
    # 303 *葡萄糖(Glu)测定-检验项值_接收时间
    # 304 *葡萄糖(Glu)测定-检验项值_异常提示
    # 305 *葡萄糖(Glu)测定-检验项值_单位
    # 306 *葡萄糖(Glu)测定-检验项值_检验定性结果
    # 307 *糖化血红蛋白(HbA1C%) -检验项值
    # 308 *糖化血红蛋白(HbA1C%) -检验项值_检验项名称
    # 309 *糖化血红蛋白(HbA1C%) -检验项值_检验项编码（别名）
    # 310 *糖化血红蛋白(HbA1C%) -检验项值_接收时间
    # 311 *糖化血红蛋白(HbA1C%) -检验项值_异常提示
    # 312 *糖化血红蛋白(HbA1C%) -检验项值_单位
    # 313 *糖化血红蛋白(HbA1C%) -检验项值_检验定性结果
    # 314 糖化血红蛋白(mMolHbA1C)-检验项值
    # 315 糖化血红蛋白(mMolHbA1C)-检验项值_检验项名称
    # 316 糖化血红蛋白(mMolHbA1C)-检验项值_检验项编码（别名）
    # 317 糖化血红蛋白(mMolHbA1C)-检验项值_接收时间
    # 318 糖化血红蛋白(mMolHbA1C)-检验项值_异常提示
    # 319 糖化血红蛋白(mMolHbA1C)-检验项值_单位
    # 320 糖化血红蛋白(mMolHbA1C)-检验项值_检验定性结果
    # 321 糖化血清蛋白(T3020)-检验项值
    # 322 糖化血清蛋白(T3020)-检验项值_检验项名称
    # 323 糖化血清蛋白(T3020)-检验项值_检验项编码（别名）
    # 324 糖化血清蛋白(T3020)-检验项值_接收时间
    # 325 糖化血清蛋白(T3020)-检验项值_异常提示
    # 326 糖化血清蛋白(T3020)-检验项值_单位
    # 327 糖化血清蛋白(T3020)-检验项值_检验定性结果
    # 328 糖化白蛋白(GA)测定-检验项值
    # 329 糖化白蛋白(GA)测定-检验项值_检验项名称
    # 330 糖化白蛋白(GA)测定-检验项值_检验项编码（别名）
    # 331 糖化白蛋白(GA)测定-检验项值_接收时间
    # 332 糖化白蛋白(GA)测定-检验项值_异常提示
    # 333 糖化白蛋白(GA)测定-检验项值_单位
    # 334 糖化白蛋白(GA)测定-检验项值_检验定性结果
    # 335 *糖化白蛋白-检验项值
    # 336 *糖化白蛋白-检验项值_检验项名称
    # 337 *糖化白蛋白-检验项值_检验项编码（别名）
    # 338 *糖化白蛋白-检验项值_接收时间
    # 339 *糖化白蛋白-检验项值_异常提示
    # 340 *糖化白蛋白-检验项值_单位
    # 341 *糖化白蛋白-检验项值_检验定性结果
    # 342 同型半胱氨酸(Hcy)测定-检验项值
    # 343 同型半胱氨酸(Hcy)测定-检验项值_检验项名称
    # 344 同型半胱氨酸(Hcy)测定-检验项值_检验项编码（别名）
    # 345 同型半胱氨酸(Hcy)测定-检验项值_接收时间
    # 346 同型半胱氨酸(Hcy)测定-检验项值_异常提示
    # 347 同型半胱氨酸(Hcy)测定-检验项值_单位
    # 348 同型半胱氨酸(Hcy)测定-检验项值_检验定性结果
    # 349 *肌酸激酶(CK)测定-检验项值
    # 350 *肌酸激酶(CK)测定-检验项值_检验项名称
    # 351 *肌酸激酶(CK)测定-检验项值_检验项编码（别名）
    # 352 *肌酸激酶(CK)测定-检验项值_接收时间
    # 353 *肌酸激酶(CK)测定-检验项值_异常提示
    # 354 *肌酸激酶(CK)测定-检验项值_单位
    # 355 *肌酸激酶(CK)测定-检验项值_检验定性结果
    # 356 肌酸激酶-MB同工酶质量(CK-MBmass)测定-检验项值
    # 357 肌酸激酶-MB同工酶质量(CK-MBmass)测定-检验项值_检验项名称
    # 358 肌酸激酶-MB同工酶质量(CK-MBmass)测定-检验项值_检验项编码（别名）
    # 359 肌酸激酶-MB同工酶质量(CK-MBmass)测定-检验项值_接收时间
    # 360 肌酸激酶-MB同工酶质量(CK-MBmass)测定-检验项值_异常提示
    # 361 肌酸激酶-MB同工酶质量(CK-MBmass)测定-检验项值_单位
    # 362 肌酸激酶-MB同工酶质量(CK-MBmass)测定-检验项值_检验定性结果
    # 363 *乳酸脱氢酶(LDH)测定-检验项值
    # 364 *乳酸脱氢酶(LDH)测定-检验项值_检验项名称
    # 365 *乳酸脱氢酶(LDH)测定-检验项值_检验项编码（别名）
    # 366 *乳酸脱氢酶(LDH)测定-检验项值_接收时间
    # 367 *乳酸脱氢酶(LDH)测定-检验项值_异常提示
    # 368 *乳酸脱氢酶(LDH)测定-检验项值_单位
    # 369 *乳酸脱氢酶(LDH)测定-检验项值_检验定性结果
    # 370 肌钙蛋白Ⅰ(TnI)测定-检验项值
    # 371 肌钙蛋白Ⅰ(TnI)测定-检验项值_检验项名称
    # 372 肌钙蛋白Ⅰ(TnI)测定-检验项值_检验项编码（别名）
    # 373 肌钙蛋白Ⅰ(TnI)测定-检验项值_接收时间
    # 374 肌钙蛋白Ⅰ(TnI)测定-检验项值_异常提示
    # 375 肌钙蛋白Ⅰ(TnI)测定-检验项值_单位
    # 376 肌钙蛋白Ⅰ(TnI)测定-检验项值_检验定性结果
    # 377 肌钙蛋白Ⅰ(hsTnI)测定-检验项值
    # 378 肌钙蛋白Ⅰ(hsTnI)测定-检验项值_检验项名称
    # 379 肌钙蛋白Ⅰ(hsTnI)测定-检验项值_检验项编码（别名）
    # 380 肌钙蛋白Ⅰ(hsTnI)测定-检验项值_接收时间
    # 381 肌钙蛋白Ⅰ(hsTnI)测定-检验项值_异常提示
    # 382 肌钙蛋白Ⅰ(hsTnI)测定-检验项值_单位
    # 383 肌钙蛋白Ⅰ(hsTnI)测定-检验项值_检验定性结果
    # 384 肌红蛋白(Mb)测定-检验项值
    # 385 肌红蛋白(Mb)测定-检验项值_检验项名称
    # 386 肌红蛋白(Mb)测定-检验项值_检验项编码（别名）
    # 387 肌红蛋白(Mb)测定-检验项值_接收时间
    # 388 肌红蛋白(Mb)测定-检验项值_异常提示
    # 389 肌红蛋白(Mb)测定-检验项值_单位
    # 390 肌红蛋白(Mb)测定-检验项值_检验定性结果
    # 391 *钠(Na)测定-检验项值
    # 392 *钠(Na)测定-检验项值_检验项名称
    # 393 *钠(Na)测定-检验项值_检验项编码（别名）
    # 394 *钠(Na)测定-检验项值_接收时间
    # 395 *钠(Na)测定-检验项值_异常提示
    # 396 *钠(Na)测定-检验项值_单位
    # 397 *钠(Na)测定-检验项值_检验定性结果
    # 398 *钾(K)测定-检验项值
    # 399 *钾(K)测定-检验项值_检验项名称
    # 400 *钾(K)测定-检验项值_检验项编码（别名）
    # 401 *钾(K)测定-检验项值_接收时间
    # 402 *钾(K)测定-检验项值_异常提示
    # 403 *钾(K)测定-检验项值_单位
    # 404 *钾(K)测定-检验项值_检验定性结果
    # 405 *氯(Cl)测定-检验项值
    # 406 *氯(Cl)测定-检验项值_检验项名称
    # 407 *氯(Cl)测定-检验项值_检验项编码（别名）
    # 408 *氯(Cl)测定-检验项值_接收时间
    # 409 *氯(Cl)测定-检验项值_异常提示
    # 410 *氯(Cl)测定-检验项值_单位
    # 411 *氯(Cl)测定-检验项值_检验定性结果
    # 412 *总钙(Ca)测定-检验项值
    # 413 *总钙(Ca)测定-检验项值_检验项名称
    # 414 *总钙(Ca)测定-检验项值_检验项编码（别名）
    # 415 *总钙(Ca)测定-检验项值_接收时间
    # 416 *总钙(Ca)测定-检验项值_异常提示
    # 417 *总钙(Ca)测定-检验项值_单位
    # 418 *总钙(Ca)测定-检验项值_检验定性结果
    # 419 *无机磷(P)测定-检验项值
    # 420 *无机磷(P)测定-检验项值_检验项名称
    # 421 *无机磷(P)测定-检验项值_检验项编码（别名）
    # 422 *无机磷(P)测定-检验项值_接收时间
    # 423 *无机磷(P)测定-检验项值_异常提示
    # 424 *无机磷(P)测定-检验项值_单位
    # 425 *无机磷(P)测定-检验项值_检验定性结果
    # 426 *镁(Mg)测定-检验项值
    # 427 *镁(Mg)测定-检验项值_检验项名称
    # 428 *镁(Mg)测定-检验项值_检验项编码（别名）
    # 429 *镁(Mg)测定-检验项值_接收时间
    # 430 *镁(Mg)测定-检验项值_异常提示
    # 431 *镁(Mg)测定-检验项值_单位
    # 432 *镁(Mg)测定-检验项值_检验定性结果
    # 433 *总蛋白(TP)测定-检验项值
    # 434 *总蛋白(TP)测定-检验项值_检验项名称
    # 435 *总蛋白(TP)测定-检验项值_检验项编码（别名）
    # 436 *总蛋白(TP)测定-检验项值_接收时间
    # 437 *总蛋白(TP)测定-检验项值_异常提示
    # 438 *总蛋白(TP)测定-检验项值_单位
    # 439 *总蛋白(TP)测定-检验项值_检验定性结果
    # 440 *白蛋白(Alb)测定-溴甲酚绿法-检验项值
    # 441 *白蛋白(Alb)测定-溴甲酚绿法-检验项值_检验项名称
    # 442 *白蛋白(Alb)测定-溴甲酚绿法-检验项值_检验项编码（别名）
    # 443 *白蛋白(Alb)测定-溴甲酚绿法-检验项值_接收时间
    # 444 *白蛋白(Alb)测定-溴甲酚绿法-检验项值_异常提示
    # 445 *白蛋白(Alb)测定-溴甲酚绿法-检验项值_单位
    # 446 *白蛋白(Alb)测定-溴甲酚绿法-检验项值_检验定性结果
    # 447 前白蛋白(PA)测定-检验项值
    # 448 前白蛋白(PA)测定-检验项值_检验项名称
    # 449 前白蛋白(PA)测定-检验项值_检验项编码（别名）
    # 450 前白蛋白(PA)测定-检验项值_接收时间
    # 451 前白蛋白(PA)测定-检验项值_异常提示
    # 452 前白蛋白(PA)测定-检验项值_单位
    # 453 前白蛋白(PA)测定-检验项值_检验定性结果
    # 454 白蛋白比球蛋白-检验项值(A/G)
    # 455 白蛋白比球蛋白-检验项值(A/G)_检验项名称
    # 456 白蛋白比球蛋白-检验项值(A/G)_检验项编码（别名）
    # 457 白蛋白比球蛋白-检验项值(A/G)_接收时间
    # 458 白蛋白比球蛋白-检验项值(A/G)_异常提示
    # 459 白蛋白比球蛋白-检验项值(A/G)_单位
    # 460 白蛋白比球蛋白-检验项值(A/G)_检验定性结果
    # 461 *总胆红素(T-Bil)测定-检验项值
    # 462 *总胆红素(T-Bil)测定-检验项值_检验项名称
    # 463 *总胆红素(T-Bil)测定-检验项值_检验项编码（别名）
    # 464 *总胆红素(T-Bil)测定-检验项值_接收时间
    # 465 *总胆红素(T-Bil)测定-检验项值_异常提示
    # 466 *总胆红素(T-Bil)测定-检验项值_单位
    # 467 *总胆红素(T-Bil)测定-检验项值_检验定性结果
    # 468 *直接胆红素(D-Bil)测定-检验项值
    # 469 *直接胆红素(D-Bil)测定-检验项值_检验项名称
    # 470 *直接胆红素(D-Bil)测定-检验项值_检验项编码（别名）
    # 471 *直接胆红素(D-Bil)测定-检验项值_接收时间
    # 472 *直接胆红素(D-Bil)测定-检验项值_异常提示
    # 473 *直接胆红素(D-Bil)测定-检验项值_单位
    # 474 *直接胆红素(D-Bil)测定-检验项值_检验定性结果
    # 475 *碱性磷酸酶(ALP)测定-检验项值
    # 476 *碱性磷酸酶(ALP)测定-检验项值_检验项名称
    # 477 *碱性磷酸酶(ALP)测定-检验项值_检验项编码（别名）
    # 478 *碱性磷酸酶(ALP)测定-检验项值_接收时间
    # 479 *碱性磷酸酶(ALP)测定-检验项值_异常提示
    # 480 *碱性磷酸酶(ALP)测定-检验项值_单位
    # 481 *碱性磷酸酶(ALP)测定-检验项值_检验定性结果
    # 482 *γ-谷氨酰基转移酶(GGT)测定-检验项值
    # 483 *γ-谷氨酰基转移酶(GGT)测定-检验项值_检验项名称
    # 484 *γ-谷氨酰基转移酶(GGT)测定-检验项值_检验项编码（别名）
    # 485 *γ-谷氨酰基转移酶(GGT)测定-检验项值_接收时间
    # 486 *γ-谷氨酰基转移酶(GGT)测定-检验项值_异常提示
    # 487 *γ-谷氨酰基转移酶(GGT)测定-检验项值_单位
    # 488 *γ-谷氨酰基转移酶(GGT)测定-检验项值_检验定性结果
    # 489 总胆汁酸(TBA)测定-检验项值
    # 490 总胆汁酸(TBA)测定-检验项值_检验项名称
    # 491 总胆汁酸(TBA)测定-检验项值_检验项编码（别名）
    # 492 总胆汁酸(TBA)测定-检验项值_接收时间
    # 493 总胆汁酸(TBA)测定-检验项值_异常提示
    # 494 总胆汁酸(TBA)测定-检验项值_单位
    # 495 总胆汁酸(TBA)测定-检验项值_检验定性结果
    # 496 胆碱脂酶(ChE)测定-检验项值
    # 497 胆碱脂酶(ChE)测定-检验项值_检验项名称
    # 498 胆碱脂酶(ChE)测定-检验项值_检验项编码（别名）
    # 499 胆碱脂酶(ChE)测定-检验项值_接收时间
    # 500 胆碱脂酶(ChE)测定-检验项值_异常提示
    # 501 胆碱脂酶(ChE)测定-检验项值_单位
    # 502 胆碱脂酶(ChE)测定-检验项值_检验定性结果
    # 503 总二氧化碳(TCO2)测定-检验项值
    # 504 总二氧化碳(TCO2)测定-检验项值_检验项名称
    # 505 总二氧化碳(TCO2)测定-检验项值_检验项编码（别名）
    # 506 总二氧化碳(TCO2)测定-检验项值_接收时间
    # 507 总二氧化碳(TCO2)测定-检验项值_异常提示
    # 508 总二氧化碳(TCO2)测定-检验项值_单位
    # 509 总二氧化碳(TCO2)测定-检验项值_检验定性结果
    # 510 阴离子间隙-检验项值
    # 511 阴离子间隙-检验项值_检验项名称
    # 512 阴离子间隙-检验项值_检验项编码（别名）
    # 513 阴离子间隙-检验项值_接收时间
    # 514 阴离子间隙-检验项值_异常提示
    # 515 阴离子间隙-检验项值_单位
    # 516 阴离子间隙-检验项值_检验定性结果
    # 517 eGFR(CKD-EPI)-检验项值
    # 518 eGFR(CKD-EPI)-检验项值_检验项名称
    # 519 eGFR(CKD-EPI)-检验项值_检验项编码（别名）
    # 520 eGFR(CKD-EPI)-检验项值_接收时间
    # 521 eGFR(CKD-EPI)-检验项值_异常提示
    # 522 eGFR(CKD-EPI)-检验项值_单位
    # 523 eGFR(CKD-EPI)-检验项值_检验定性结果
    # 524 游离脂肪酸(FFA)测定-检验项值
    # 525 游离脂肪酸(FFA)测定-检验项值_检验项名称
    # 526 游离脂肪酸(FFA)测定-检验项值_检验项编码（别名）
    # 527 游离脂肪酸(FFA)测定-检验项值_接收时间
    # 528 游离脂肪酸(FFA)测定-检验项值_异常提示
    # 529 游离脂肪酸(FFA)测定-检验项值_单位
    # 530 游离脂肪酸(FFA)测定-检验项值_检验定性结果
    # 531 非高密度脂蛋白胆固醇(nonHDL)-检验项值
    # 532 非高密度脂蛋白胆固醇(nonHDL)-检验项值_检验项名称
    # 533 非高密度脂蛋白胆固醇(nonHDL)-检验项值_检验项编码（别名）
    # 534 非高密度脂蛋白胆固醇(nonHDL)-检验项值_接收时间
    # 535 非高密度脂蛋白胆固醇(nonHDL)-检验项值_异常提示
    # 536 非高密度脂蛋白胆固醇(nonHDL)-检验项值_单位
    # 537 非高密度脂蛋白胆固醇(nonHDL)-检验项值_检验定性结果
    # 538 小而密低密度脂蛋白(sdLDL)测定-检验项值
    # 539 小而密低密度脂蛋白(sdLDL)测定-检验项值_检验项名称
    # 540 小而密低密度脂蛋白(sdLDL)测定-检验项值_检验项编码（别名）
    # 541 小而密低密度脂蛋白(sdLDL)测定-检验项值_接收时间
    # 542 小而密低密度脂蛋白(sdLDL)测定-检验项值_异常提示
    # 543 小而密低密度脂蛋白(sdLDL)测定-检验项值_单位
    # 544 小而密低密度脂蛋白(sdLDL)测定-检验项值_检验定性结果
    # 545 C1q测定-检验项值
    # 546 C1q测定-检验项值_检验项名称
    # 547 C1q测定-检验项值_检验项编码（别名）
    # 548 C1q测定-检验项值_接收时间
    # 549 C1q测定-检验项值_异常提示
    # 550 C1q测定-检验项值_单位
    # 551 C1q测定-检验项值_检验定性结果
    # 552 脂蛋白a(LPa)测定-检验项值
    # 553 脂蛋白a(LPa)测定-检验项值_检验项名称
    # 554 脂蛋白a(LPa)测定-检验项值_检验项编码（别名）
    # 555 脂蛋白a(LPa)测定-检验项值_接收时间
    # 556 脂蛋白a(LPa)测定-检验项值_异常提示
    # 557 脂蛋白a(LPa)测定-检验项值_单位
    # 558 脂蛋白a(LPa)测定-检验项值_检验定性结果
    # 559 载脂蛋白AⅠ(apoAⅠ)测定-检验项值
    # 560 载脂蛋白AⅠ(apoAⅠ)测定-检验项值_检验项名称
    # 561 载脂蛋白AⅠ(apoAⅠ)测定-检验项值_检验项编码（别名）
    # 562 载脂蛋白AⅠ(apoAⅠ)测定-检验项值_接收时间
    # 563 载脂蛋白AⅠ(apoAⅠ)测定-检验项值_异常提示
    # 564 载脂蛋白AⅠ(apoAⅠ)测定-检验项值_单位
    # 565 载脂蛋白AⅠ(apoAⅠ)测定-检验项值_检验定性结果
    # 566 载脂蛋白B(apoB)测定-检验项值
    # 567 载脂蛋白B(apoB)测定-检验项值_检验项名称
    # 568 载脂蛋白B(apoB)测定-检验项值_检验项编码（别名）
    # 569 载脂蛋白B(apoB)测定-检验项值_接收时间
    # 570 载脂蛋白B(apoB)测定-检验项值_异常提示
    # 571 载脂蛋白B(apoB)测定-检验项值_单位
    # 572 载脂蛋白B(apoB)测定-检验项值_检验定性结果
    # 573 B型钠酸肽-检验项值
    # 574 B型钠酸肽-检验项值_检验项名称
    # 575 B型钠酸肽-检验项值_检验项编码（别名）
    # 576 B型钠酸肽-检验项值_接收时间
    # 577 B型钠酸肽-检验项值_异常提示
    # 578 B型钠酸肽-检验项值_单位
    # 579 B型钠酸肽-检验项值_检验定性结果
    # 580 N端-B型钠尿肽前体(NT-ProBNP)测定-检验项值
    # 581 N端-B型钠尿肽前体(NT-ProBNP)测定-检验项值_检验项名称
    # 582 N端-B型钠尿肽前体(NT-ProBNP)测定-检验项值_检验项编码（别名）
    # 583 N端-B型钠尿肽前体(NT-ProBNP)测定-检验项值_接收时间
    # 584 N端-B型钠尿肽前体(NT-ProBNP)测定-检验项值_异常提示
    # 585 N端-B型钠尿肽前体(NT-ProBNP)测定-检验项值_单位
    # 586 N端-B型钠尿肽前体(NT-ProBNP)测定-检验项值_检验定性结果
    # 587 血浆凝血酶原时间(PT)测定-检验项值
    # 588 血浆凝血酶原时间(PT)测定-检验项值_检验项名称
    # 589 血浆凝血酶原时间(PT)测定-检验项值_检验项编码（别名）
    # 590 血浆凝血酶原时间(PT)测定-检验项值_接收时间
    # 591 血浆凝血酶原时间(PT)测定-检验项值_异常提示
    # 592 血浆凝血酶原时间(PT)测定-检验项值_单位
    # 593 血浆凝血酶原时间(PT)测定-检验项值_检验定性结果
    # 594 凝血酶原活动度（PT%）-检验项值
    # 595 凝血酶原活动度（PT%）-检验项值_检验项名称
    # 596 凝血酶原活动度（PT%）-检验项值_检验项编码（别名）
    # 597 凝血酶原活动度（PT%）-检验项值_接收时间
    # 598 凝血酶原活动度（PT%）-检验项值_异常提示
    # 599 凝血酶原活动度（PT%）-检验项值_单位
    # 600 凝血酶原活动度（PT%）-检验项值_检验定性结果
    # 601 活化部分凝血活酶时间(APTT)测定-检验项值
    # 602 活化部分凝血活酶时间(APTT)测定-检验项值_检验项名称
    # 603 活化部分凝血活酶时间(APTT)测定-检验项值_检验项编码（别名）
    # 604 活化部分凝血活酶时间(APTT)测定-检验项值_接收时间
    # 605 活化部分凝血活酶时间(APTT)测定-检验项值_异常提示
    # 606 活化部分凝血活酶时间(APTT)测定-检验项值_单位
    # 607 活化部分凝血活酶时间(APTT)测定-检验项值_检验定性结果
    # 608 国际标准化比值（INR） -检验项值
    # 609 国际标准化比值（INR） -检验项值_检验项名称
    # 610 国际标准化比值（INR） -检验项值_检验项编码（别名）
    # 611 国际标准化比值（INR） -检验项值_接收时间
    # 612 国际标准化比值（INR） -检验项值_异常提示
    # 613 国际标准化比值（INR） -检验项值_单位
    # 614 国际标准化比值（INR） -检验项值_检验定性结果
    # 615 纤维蛋白(原)降解产物(FDP)测定-检验项值
    # 616 纤维蛋白(原)降解产物(FDP)测定-检验项值_检验项名称
    # 617 纤维蛋白(原)降解产物(FDP)测定-检验项值_检验项编码（别名）
    # 618 纤维蛋白(原)降解产物(FDP)测定-检验项值_接收时间
    # 619 纤维蛋白(原)降解产物(FDP)测定-检验项值_异常提示
    # 620 纤维蛋白(原)降解产物(FDP)测定-检验项值_单位
    # 621 纤维蛋白(原)降解产物(FDP)测定-检验项值_检验定性结果
    # 622 血浆纤维蛋白原测定（FBG）-检验项值
    # 623 血浆纤维蛋白原测定（FBG）-检验项值_检验项名称
    # 624 血浆纤维蛋白原测定（FBG）-检验项值_检验项编码（别名）
    # 625 血浆纤维蛋白原测定（FBG）-检验项值_接收时间
    # 626 血浆纤维蛋白原测定（FBG）-检验项值_异常提示
    # 627 血浆纤维蛋白原测定（FBG）-检验项值_单位
    # 628 血浆纤维蛋白原测定（FBG）-检验项值_检验定性结果
    # 629 血浆D-二聚体(D-Dimer)测定-检验项值
    # 630 血浆D-二聚体(D-Dimer)测定-检验项值_检验项名称
    # 631 血浆D-二聚体(D-Dimer)测定-检验项值_检验项编码（别名）
    # 632 血浆D-二聚体(D-Dimer)测定-检验项值_接收时间
    # 633 血浆D-二聚体(D-Dimer)测定-检验项值_异常提示
    # 634 血浆D-二聚体(D-Dimer)测定-检验项值_单位
    # 635 血浆D-二聚体(D-Dimer)测定-检验项值_检验定性结果
    # 636 血浆抗凝血酶活性(AT:A)测定-检验项值
    # 637 血浆抗凝血酶活性(AT:A)测定-检验项值_检验项名称
    # 638 血浆抗凝血酶活性(AT:A)测定-检验项值_检验项编码（别名）
    # 639 血浆抗凝血酶活性(AT:A)测定-检验项值_接收时间
    # 640 血浆抗凝血酶活性(AT:A)测定-检验项值_异常提示
    # 641 血浆抗凝血酶活性(AT:A)测定-检验项值_单位
    # 642 血浆抗凝血酶活性(AT:A)测定-检验项值_检验定性结果
    # 643 凝血酶时间(TT)测定-检验项值
    # 644 凝血酶时间(TT)测定-检验项值_检验项名称
    # 645 凝血酶时间(TT)测定-检验项值_检验项编码（别名）
    # 646 凝血酶时间(TT)测定-检验项值_接收时间
    # 647 凝血酶时间(TT)测定-检验项值_异常提示
    # 648 凝血酶时间(TT)测定-检验项值_单位
    # 649 凝血酶时间(TT)测定-检验项值_检验定性结果
    # 650 尿RBC(红细胞)-检验项值
    # 651 尿RBC(红细胞)-检验项值_检验项名称
    # 652 尿RBC(红细胞)-检验项值_检验项编码（别名）
    # 653 尿RBC(红细胞)-检验项值_接收时间
    # 654 尿RBC(红细胞)-检验项值_异常提示
    # 655 尿RBC(红细胞)-检验项值_单位
    # 656 尿RBC(红细胞)-检验项值_检验定性结果
    # 657 尿白细胞(WBC)-检验项值
    # 658 尿白细胞(WBC)-检验项值_检验项名称
    # 659 尿白细胞(WBC)-检验项值_检验项编码（别名）
    # 660 尿白细胞(WBC)-检验项值_接收时间
    # 661 尿白细胞(WBC)-检验项值_异常提示
    # 662 尿白细胞(WBC)-检验项值_单位
    # 663 尿白细胞(WBC)-检验项值_检验定性结果
    # 664 尿离心后镜检红细胞-检验项值
    # 665 尿离心后镜检红细胞-检验项值_检验项名称
    # 666 尿离心后镜检红细胞-检验项值_检验项编码（别名）
    # 667 尿离心后镜检红细胞-检验项值_接收时间
    # 668 尿离心后镜检红细胞-检验项值_异常提示
    # 669 尿离心后镜检红细胞-检验项值_单位
    # 670 尿离心后镜检红细胞-检验项值_检验定性结果
    # 671 尿离心后镜检白细胞-检验项值
    # 672 尿离心后镜检白细胞-检验项值_检验项名称
    # 673 尿离心后镜检白细胞-检验项值_检验项编码（别名）
    # 674 尿离心后镜检白细胞-检验项值_接收时间
    # 675 尿离心后镜检白细胞-检验项值_异常提示
    # 676 尿离心后镜检白细胞-检验项值_单位
    # 677 尿离心后镜检白细胞-检验项值_检验定性结果
    # 678 尿酮体-检验项值
    # 679 尿酮体-检验项值_检验项名称
    # 680 尿酮体-检验项值_检验项编码（别名）
    # 681 尿酮体-检验项值_接收时间
    # 682 尿酮体-检验项值_异常提示
    # 683 尿酮体-检验项值_单位
    # 684 尿酮体-检验项值_检验定性结果
    # 685 尿比重-检验项值
    # 686 尿比重-检验项值_检验项名称
    # 687 尿比重-检验项值_检验项编码（别名）
    # 688 尿比重-检验项值_接收时间
    # 689 尿比重-检验项值_异常提示
    # 690 尿比重-检验项值_单位
    # 691 尿比重-检验项值_检验定性结果
    # 692 尿酸碱度-检验项值
    # 693 尿酸碱度-检验项值_检验项名称
    # 694 尿酸碱度-检验项值_检验项编码（别名）
    # 695 尿酸碱度-检验项值_接收时间
    # 696 尿酸碱度-检验项值_异常提示
    # 697 尿酸碱度-检验项值_单位
    # 698 尿酸碱度-检验项值_检验定性结果
    # 699 尿糖-检验项值
    # 700 尿糖-检验项值_检验项名称
    # 701 尿糖-检验项值_检验项编码（别名）
    # 702 尿糖-检验项值_接收时间
    # 703 尿糖-检验项值_异常提示
    # 704 尿糖-检验项值_单位
    # 705 尿糖-检验项值_检验定性结果
    # 706 尿胆红素-检验项值
    # 707 尿胆红素-检验项值_检验项名称
    # 708 尿胆红素-检验项值_检验项编码（别名）
    # 709 尿胆红素-检验项值_接收时间
    # 710 尿胆红素-检验项值_异常提示
    # 711 尿胆红素-检验项值_单位
    # 712 尿胆红素-检验项值_检验定性结果
    # 713 尿蛋白-检验项值
    # 714 尿蛋白-检验项值_检验项名称
    # 715 尿蛋白-检验项值_检验项编码（别名）
    # 716 尿蛋白-检验项值_接收时间
    # 717 尿蛋白-检验项值_异常提示
    # 718 尿蛋白-检验项值_单位
    # 719 尿蛋白-检验项值_检验定性结果
    # 720 尿潜血-检验项值
    # 721 尿潜血-检验项值_检验项名称
    # 722 尿潜血-检验项值_检验项编码（别名）
    # 723 尿潜血-检验项值_接收时间
    # 724 尿潜血-检验项值_异常提示
    # 725 尿潜血-检验项值_单位
    # 726 尿潜血-检验项值_检验定性结果
    # 727 尿白细胞（LEU）-检验项值
    # 728 尿白细胞（LEU）-检验项值_检验项名称
    # 729 尿白细胞（LEU）-检验项值_检验项编码（别名）
    # 730 尿白细胞（LEU）-检验项值_接收时间
    # 731 尿白细胞（LEU）-检验项值_异常提示
    # 732 尿白细胞（LEU）-检验项值_单位
    # 733 尿白细胞（LEU）-检验项值_检验定性结果
    # 734 尿微量白蛋白(mAlb)测定
    # 735 尿微量白蛋白(mAlb)测定_检验项名称
    # 736 尿微量白蛋白(mAlb)测定_检验项编码（别名）
    # 737 尿微量白蛋白(mAlb)测定_接收时间
    # 738 尿微量白蛋白(mAlb)测定_异常提示
    # 739 尿微量白蛋白(mAlb)测定_单位
    # 740 尿微量白蛋白(mAlb)测定_检验定性结果
    # 741 亚硝酸盐-检验项值
    # 742 亚硝酸盐-检验项值_检验项名称
    # 743 亚硝酸盐-检验项值_检验项编码（别名）
    # 744 亚硝酸盐-检验项值_接收时间
    # 745 亚硝酸盐-检验项值_异常提示
    # 746 亚硝酸盐-检验项值_单位
    # 747 亚硝酸盐-检验项值_检验定性结果
    # 748 尿胆元-检验项值
    # 749 尿胆元-检验项值_检验项名称
    # 750 尿胆元-检验项值_检验项编码（别名）
    # 751 尿胆元-检验项值_接收时间
    # 752 尿胆元-检验项值_异常提示
    # 753 尿胆元-检验项值_单位
    # 754 尿胆元-检验项值_检验定性结果
    # 755 便潜血[OB]-检验项值
    # 756 便潜血[OB]-检验项值_检验项名称
    # 757 便潜血[OB]-检验项值_检验项编码（别名）
    # 758 便潜血[OB]-检验项值_接收时间
    # 759 便潜血[OB]-检验项值_异常提示
    # 760 便潜血[OB]-检验项值_单位
    # 761 便潜血[OB]-检验项值_检验定性结果
    # 762 甲状腺素(T4)测定-检验项值
    # 763 甲状腺素(T4)测定-检验项值_检验项名称
    # 764 甲状腺素(T4)测定-检验项值_检验项编码（别名）
    # 765 甲状腺素(T4)测定-检验项值_接收时间
    # 766 甲状腺素(T4)测定-检验项值_异常提示
    # 767 甲状腺素(T4)测定-检验项值_单位
    # 768 甲状腺素(T4)测定-检验项值_检验定性结果
    # 769 三碘甲状腺原氨酸(T3)测定-检验项值
    # 770 三碘甲状腺原氨酸(T3)测定-检验项值_检验项名称
    # 771 三碘甲状腺原氨酸(T3)测定-检验项值_检验项编码（别名）
    # 772 三碘甲状腺原氨酸(T3)测定-检验项值_接收时间
    # 773 三碘甲状腺原氨酸(T3)测定-检验项值_异常提示
    # 774 三碘甲状腺原氨酸(T3)测定-检验项值_单位
    # 775 三碘甲状腺原氨酸(T3)测定-检验项值_检验定性结果
    # 776 促甲状腺激素(TSH)测定-检验项值
    # 777 促甲状腺激素(TSH)测定-检验项值_检验项名称
    # 778 促甲状腺激素(TSH)测定-检验项值_检验项编码（别名）
    # 779 促甲状腺激素(TSH)测定-检验项值_接收时间
    # 780 促甲状腺激素(TSH)测定-检验项值_异常提示
    # 781 促甲状腺激素(TSH)测定-检验项值_单位
    # 782 促甲状腺激素(TSH)测定-检验项值_检验定性结果
    # 783 游离三碘甲状腺原氨酸(FT3)测定-检验项值
    # 784 游离三碘甲状腺原氨酸(FT3)测定-检验项值_检验项名称
    # 785 游离三碘甲状腺原氨酸(FT3)测定-检验项值_检验项编码（别名）
    # 786 游离三碘甲状腺原氨酸(FT3)测定-检验项值_接收时间
    # 787 游离三碘甲状腺原氨酸(FT3)测定-检验项值_异常提示
    # 788 游离三碘甲状腺原氨酸(FT3)测定-检验项值_单位
    # 789 游离三碘甲状腺原氨酸(FT3)测定-检验项值_检验定性结果
    # 790 游离甲状腺素(FT4)测定-检验项值
    # 791 游离甲状腺素(FT4)测定-检验项值_检验项名称
    # 792 游离甲状腺素(FT4)测定-检验项值_检验项编码（别名）
    # 793 游离甲状腺素(FT4)测定-检验项值_接收时间
    # 794 游离甲状腺素(FT4)测定-检验项值_异常提示
    # 795 游离甲状腺素(FT4)测定-检验项值_单位
    # 796 游离甲状腺素(FT4)测定-检验项值_检验定性结果
    # 797 甲状腺微粒体抗体-检验项值
    # 798 甲状腺微粒体抗体-检验项值_检验项名称
    # 799 甲状腺微粒体抗体-检验项值_检验项编码（别名）
    # 800 甲状腺微粒体抗体-检验项值_接收时间
    # 801 甲状腺微粒体抗体-检验项值_异常提示
    # 802 甲状腺微粒体抗体-检验项值_单位
    # 803 甲状腺微粒体抗体-检验项值_检验定性结果
    # 804 抗甲状腺过氧化物酶抗体(TPOAb)测定-检验项值
    # 805 抗甲状腺过氧化物酶抗体(TPOAb)测定-检验项值_检验项名称
    # 806 抗甲状腺过氧化物酶抗体(TPOAb)测定-检验项值_检验项编码（别名）
    # 807 抗甲状腺过氧化物酶抗体(TPOAb)测定-检验项值_接收时间
    # 808 抗甲状腺过氧化物酶抗体(TPOAb)测定-检验项值_异常提示
    # 809 抗甲状腺过氧化物酶抗体(TPOAb)测定-检验项值_单位
    # 810 抗甲状腺过氧化物酶抗体(TPOAb)测定-检验项值_检验定性结果
    # 811 抗甲状腺球蛋白抗体(TGAb)测定-检验项值
    # 812 抗甲状腺球蛋白抗体(TGAb)测定-检验项值_检验项名称
    # 813 抗甲状腺球蛋白抗体(TGAb)测定-检验项值_检验项编码（别名）
    # 814 抗甲状腺球蛋白抗体(TGAb)测定-检验项值_接收时间
    # 815 抗甲状腺球蛋白抗体(TGAb)测定-检验项值_异常提示
    # 816 抗甲状腺球蛋白抗体(TGAb)测定-检验项值_单位
    # 817 抗甲状腺球蛋白抗体(TGAb)测定-检验项值_检验定性结果
    # 818 甲状旁腺激素PTH-检验项值
    # 819 甲状旁腺激素PTH-检验项值_检验项名称
    # 820 甲状旁腺激素PTH-检验项值_检验项编码（别名）
    # 821 甲状旁腺激素PTH-检验项值_接收时间
    # 822 甲状旁腺激素PTH-检验项值_异常提示
    # 823 甲状旁腺激素PTH-检验项值_单位
    # 824 甲状旁腺激素PTH-检验项值_检验定性结果
    for i in range(54, 818, 7):
        text += processValueIndex(row[i:i+7])
        sentences.append("患者" + processValueIndex(row[i:i+7]))
    # 825 胸骨侧位
    # 826 胸骨侧位_检查所见
    # 827 胸骨侧位_检查结果
    # 828 胸骨侧位_报告日期
    # 829 胸片穿胸位
    # 830 胸片穿胸位_检查所见
    # 831 胸片穿胸位_检查结果
    # 832 胸片穿胸位_报告日期
    # 833 胸片前弓位
    # 834 胸片前弓位_检查所见
    # 835 胸片前弓位_检查结果
    # 836 胸片前弓位_报告日期
    # 837 胸片右侧位
    # 838 胸片右侧位_检查所见
    # 839 胸片右侧位_检查结果
    # 840 胸片右侧位_报告日期
    # 841 胸片右前斜位
    # 842 胸片右前斜位_检查所见
    # 843 胸片右前斜位_检查结果
    # 844 胸片右前斜位_报告日期
    # 845 胸片正侧位
    # 846 胸片正侧位_检查所见
    # 847 胸片正侧位_检查结果
    # 848 胸片正侧位_报告日期
    # 849 胸片正位
    # 850 胸片正位_检查所见
    # 851 胸片正位_检查结果
    # 852 胸片正位_报告日期
    # 853 胸片正位+右侧位
    # 854 胸片正位+右侧位_检查所见
    # 855 胸片正位+右侧位_检查结果
    # 856 胸片正位+右侧位_报告日期
    # 857 胸片正位+右前斜位
    # 858 胸片正位+右前斜位_检查所见
    # 859 胸片正位+右前斜位_检查结果
    # 860 胸片正位+右前斜位_报告日期
    # 861 胸片正位+左侧位
    # 862 胸片正位+左侧位_检查所见
    # 863 胸片正位+左侧位_检查结果
    # 864 胸片正位+左侧位_报告日期
    # 865 胸片正位+左侧位+右侧位
    # 866 胸片正位+左侧位+右侧位_检查所见
    # 867 胸片正位+左侧位+右侧位_检查结果
    # 868 胸片正位+左侧位+右侧位_报告日期
    # 869 胸片正位+左前斜位
    # 870 胸片正位+左前斜位_检查所见
    # 871 胸片正位+左前斜位_检查结果
    # 872 胸片正位+左前斜位_报告日期
    # 873 胸片左侧位
    # 874 胸片左侧位_检查所见
    # 875 胸片左侧位_检查结果
    # 876 胸片左侧位_报告日期
    # 877 胸片正位[不出片]
    # 878 胸片正位[不出片]_检查所见
    # 879 胸片正位[不出片]_检查结果
    # 880 胸片正位[不出片]_报告日期
    # 881 胸部平片(PICC定位)
    # 882 胸部平片(PICC定位)_检查所见
    # 883 胸部平片(PICC定位)_检查结果
    # 884 胸部平片(PICC定位)_报告日期
    # 885 胸部X线计算机体层(CT)平扫
    # 886 胸部X线计算机体层(CT)平扫_检查所见
    # 887 胸部X线计算机体层(CT)平扫_检查结果
    # 888 胸部X线计算机体层(CT)平扫_报告日期
    # 889 胸部CT增强扫描+三维成像
    # 890 胸部CT增强扫描+三维成像_检查所见
    # 891 胸部CT增强扫描+三维成像_检查结果
    # 892 胸部CT增强扫描+三维成像_报告日期
    # 893 胸部X线计算机体层(CT)增强扫描(多期扫描)
    # 894 胸部X线计算机体层(CT)增强扫描(多期扫描)_检查所见
    # 895 胸部X线计算机体层(CT)增强扫描(多期扫描)_检查结果
    # 896 胸部X线计算机体层(CT)增强扫描(多期扫描)_报告日期
    # 897 胸部CT平扫+三维成像
    # 898 胸部CT平扫+三维成像_检查所见
    # 899 胸部CT平扫+三维成像_检查结果
    # 900 胸部CT平扫+三维成像_报告日期
    # 901 胸部CT平扫(入院检查)
    # 902 胸部CT平扫(入院检查)_检查所见
    # 903 胸部CT平扫(入院检查)_检查结果
    # 904 胸部CT平扫(入院检查)_报告日期
    for i in range(824, 901, 4):
        text += processReportIndex(row[i:i+4], columns)
        sentences.append("患者" + processReportIndex(row[i:i+4], columns))
    
    # drop all 磁共振
    # 905 磁共振心脏功能评价
    # 906 磁共振心脏功能评价_检查所见
    # 907 磁共振心脏功能评价_检查结果
    # 908 磁共振心脏功能评价_报告日期
    # 909 冠脉磁共振成像
    # 910 冠脉磁共振成像_检查所见
    # 911 冠脉磁共振成像_检查结果
    # 912 冠脉磁共振成像_报告日期
    # 913 心脏磁共振平扫成像
    # 914 心脏磁共振平扫成像_检查所见
    # 915 心脏磁共振平扫成像_检查结果
    # 916 心脏磁共振平扫成像_报告日期
    # 917 心脏磁共振增强成像
    # 918 心脏磁共振增强成像_检查所见
    # 919 心脏磁共振增强成像_检查结果
    # 920 心脏磁共振增强成像_报告日期
    # 921 （特需）冠脉磁共振成像
    # 922 （特需）冠脉磁共振成像_检查所见
    # 923 （特需）冠脉磁共振成像_检查结果
    # 924 （特需）冠脉磁共振成像_报告日期
    # 925 （特需）心脏磁共振增强成像
    # 926 （特需）心脏磁共振增强成像_检查所见
    # 927 （特需）心脏磁共振增强成像_检查结果
    # 928 （特需）心脏磁共振增强成像_报告日期
    # 929 （特需）磁共振心脏功能评价
    # 930 （特需）磁共振心脏功能评价_检查所见
    # 931 （特需）磁共振心脏功能评价_检查结果
    # 932 （特需）磁共振心脏功能评价_报告日期
    # 933 （特需）心脏磁共振平扫成像
    # 934 （特需）心脏磁共振平扫成像_检查所见
    # 935 （特需）心脏磁共振平扫成像_检查结果
    # 936 （特需）心脏磁共振平扫成像_报告日期
    # 937 心脏磁共振成像
    # 938 心脏磁共振成像_检查所见
    # 939 心脏磁共振成像_检查结果
    # 940 心脏磁共振成像_报告日期
    # 941 (特需)心脏磁共振成像
    # 942 (特需)心脏磁共振成像_检查所见
    # 943 (特需)心脏磁共振成像_检查结果
    # 944 (特需)心脏磁共振成像_报告日期

    # 945 电脑多导联心电图(心电图)
    # 946 电脑多导联心电图(心电图)_检查所见
    # 947 电脑多导联心电图(心电图)_检查结果
    # 948 电脑多导联心电图(心电图)_报告日期
    for i in range(944, 948, 4):
        text += processReportIndex(row[i:i+4], columns)
        sentences.append("患者" + processReportIndex(row[i:i+4], columns))

    text = text[:-1] + "。"
    return text, sentences

# Path
metaPath = '../ecg_data/xianweihua/ZuoSong20230703.xlsx'

positiveTable = pd.read_excel(io=metaPath, sheet_name='核磁纤维化', header=2, dtype=str, keep_default_na=False) #, nrows=5)
negativeTable = pd.read_excel(io=metaPath, sheet_name='住院核磁',   header=2, dtype=str, keep_default_na=False) #, nrows=5)

positiveTable = positiveTable.drop(positiveTable.columns[[938, 939]], axis=1)

positiveColumns = positiveTable.columns
negativeColumns = negativeTable.columns

# check the columns of two table
for i in range(min(len(positiveColumns), len(negativeColumns))):
    if positiveColumns[i] != negativeColumns[i]:
        print(i, positiveColumns[i], negativeColumns[i])
        break

# print columns
# for i, column in enumerate(positiveColumns):
#     print('    #', i+1, column)

print(processRow(positiveTable.iloc[0], positiveColumns))

mode = 'all' # ['all', 'annotated']

textDict = {}

textDict = {}
sentencesDict = {}

bar = tqdm(total=len(positiveTable), ncols=120, desc="Positive")
for idx, row in positiveTable.iterrows():
    text, sentences = processRow(row, positiveColumns)
    textDict[row[7]] = text
    sentencesDict[row[7]] = sentences
    bar.update(1)
    # print(text)
    # print()

bar = tqdm(total=len(negativeTable), ncols=120, desc="Negative")
for idx, row in negativeTable.iterrows():
    text, sentences = processRow(row, negativeColumns)
    textDict[row[7]] = text
    sentencesDict[row[7]] = sentences
    bar.update(1)
    # print(text)
    # print()

annoRoots = ['../ecg_data/xianweihua/Annos3/NMR+', '../ecg_data/xianweihua/Annos3/NMR-']
outPath = '../ecg_data_processed/xianweihua/qwen2Embedding'

if not os.path.exists(outPath):
    os.makedirs(outPath)

# model = SentenceTransformer('/DATA/DATANAS1/hrz/azhospital/SeqCls/iKang/text_embedding/acge_text_embedding')
# model = SentenceTransformer('/DATA/DATANAS1/hrz/azhospital/SeqCls/iKang/text_embedding/gte-Qwen1.5-7B-instruct').half()
model = SentenceTransformer('/DATA/DATANAS1/hrz/azhospital/SeqCls/iKang/text_embedding/gte-Qwen2-7B-instruct').half()
# model.max_seq_length = 8192

textLens = []
sentencesLens = []
for annoRoot in annoRoots:
    annoNames = os.listdir(annoRoot)
    if "desktop.ini" in annoNames:
        annoNames.remove("desktop.ini")
    annoNames.sort()

    bar = tqdm(total=len(annoNames), ncols=120, desc="Text Embedding")
    for annoid, annoName in enumerate(annoNames):
        regisno = annoName[:10]
        if annoName == '00518482529-20220110.2.json':
            regisno = '0051848529'
        text = textDict.get(regisno, None)
        sentences = sentencesDict.get(regisno, None)
        if text is None:
            regisno = annoName[:8]
            text = textDict.get(regisno, None)
            sentences = sentencesDict.get(regisno, None)
        if text is None:
            import pdb; pdb.set_trace()
        textLens.append(len(text))
        for sentence in sentences:
            sentencesLens.append(len(sentence))
        
        # print(annoid, len(text))

        # process the entire text
        # splits = [text[i:i+1024] for i in range(0, len(text), 512)]
        

        # process the sperate text
        splits = []
        for sentence in sentences:
            if len(sentence) < 1024:
                splits.append(sentence)
            else:
                splits += [text[i:i+1024] for i in range(0, len(sentence), 512)]
        
        embeddings = model.encode(splits, normalize_embeddings=True)
        # embeddings = model.encode(sentences, normalize_embeddings=True, batch_size=1)
        np.save(os.path.join(outPath, annoName.replace('.json', '.npy')), embeddings)
        bar.update(1)

print(min(textLens), max(textLens))

# import pdb; pdb.set_trace()